/**
 * ORIGINAL messages2_ja.js
 * clcom-ana.js 内部の clmsg を拡張できるタイミングに合わせるために $(function(){...}) で括る。
 */
$(function(){
	clmsg = _.extend((typeof clmsg === 'undefined') && {} || clmsg, {
		cl_nodata: '検索結果は0件です。',
		EGA0001: "購入会員集計用領域の確保に失敗しました。絞込条件を追加してください。",
		EGA0002: "軸要素数が最大値を超えています。",
		EGA0003: "集計最大セル数を超えています。{0}",
		EGA0004: "表示最大セル数を超えています。{0}",
		EGA0005: "表示項目を１つ以上指定してください",
		EGA0006: "計算式が正しくありません。",
		EGA0007: "セルの数が最大値を超えています。{0}",
		EGA0008: "指定された店舗リストは削除されています。",
		EGA0009: "指定された商品リストは削除されています。",
		EGA0010: "指定された会員リストは削除されています。",
		EGA0011: "指定された住所リストは削除されています。",
		EGA0012: "指定された組織リストの組織階層が店舗検索日では有効ではありません。",
		EGA0013: "指定された商品リストの商品分類階層が商品検索日では有効ではありません。",
		EGA0014: "閾値条件を指定してください",
		EGA0015: "縦軸の要素数がEXCEL出力が最大値を超えています。{0}",
		EGA0016: "横軸の要素数がEXCEL出力が最大値を超えています。{0}",
		EGA0017: "絞込条件により対象となる軸の要素数がゼロになりました。",
		EGA0018: "配下に要素があるため削除できません",
		EGA0019: "軸条件を指定してください。",
		EGA0020: "表示項目を指定してください",
		EGA0021: "期間対比で日付軸を指定することはできません。",
		EGA0022: "登録場所が既に削除されています。",
		EGA0023: "任意条件で利用されているため削除できません。",
		EGA0024: "任意条件で利用されているため削除できません。",
		EGA0025: "検索結果が多ぎます。絞込条件を追加してください。",
		EGA0026: "在庫日数を表示する場合は、売上数も指定してください。",
		EGA0027: "CSVテキストファイルではありません。",
		EGA0028: "ABC分析では、「ランク」表示項目を必ず指定してください。",
		EGA0029: "ABC分析基準が売上高の場合、「売上高(税抜)順位」表示項目を必ず指定してください。",
		EGA0030: "ABC分析基準が売上数の場合、「売上数順位」表示項目を必ず指定してください。",
		_eof: "clmsg//"
	});
});
