var labels = [
  '売上金額',
  '客数',
  '社員労働時間',
  '清算数',
  'ＰＡ労働時間',
  'ロス金額',
  '平均客単価',
  '社員労働賃金',
  'ＰＩ値',
  'ＰＡ労働賃金',
  '粗利金額',
  'クーポン回収数',
  '粗利率',
  'クーポン対象金額',
  '科目金額',
  '仕入金額',
  'クーポン割引金額',
  'クーポン対象客数',
  '科目予算',
  '発注金額',
  '売上予算',
  '客数予算',
  '在庫金額'
];

var yLabels = [
  '20130301',
  '20130302',
  '20130303',
  '20130304',
  '20130305',
  '20130306',
  '20130307',
  '20130308',
  '20130309',
  '20130310',
  '20130311',
  '20130312',
  '20130313',
  '20130314',
  '20130315',
  '20130316',
  '20130317',
  '20130318',
  '20130319',
  '20130320',
  '20130321',
  '20130322',
  '20130323',
  '20130324',
  '20130325',
  '20130326',
  '20130327',
  '20130328',
  '20130329',
  '20130330',
  '20130331'
];

$(function () {
  var $table = $('#table1');

  _.each(labels, function (label)  {
    $('thead > tr', $table).append('<th class="">' + label + '</th>');
  });

  var $tbody = $table.find('tbody');
  _.each(yLabels, function (yLabel) {
    var $tr = $('<tr>').appendTo($tbody);
    $tr.append('<td>' + yLabel + '</td>');
    _.each(labels, function (i) {
      $tr.append('<td class="align-right">9,999,999</td>');
    });
  });

  $table.tablefix({
    width: $table.parent().width(),
    fixCols: 1,
    height: 300,
    fixRows: 1
  });
});
